[{"message":"Stoned at Paradise Biriyani 😠😠😠. Lotsa stones in the Biriyani - Cancelled the order - Reported to the manager - Walked out.","id":"527236893956335_1000144716665548"},{"message":"Heard a lot about paragon biryani finally get to eat an amazing biryani ... Just loved it ... Must try food for bangloreans who get to visit Cochin..","id":"527236893956335_1000172363329450","picture":"https://scontent-b.xx.fbcdn.net/hphotos-xfp1/v/t1.0-9/s130x130/1601572_918589888175167_6357614273198283905_n.jpg?oh=290542195c8b50e3a55c235bf43360ee&oe=5557AD1D"},{"message":"Just picked up Chicken Tikka and Chicken Biryani parcel from Paradise .. Let's see how it tastes :)","id":"527236893956335_1000339276646092","picture":"https://fbcdn-sphotos-e-a.akamaihd.net/hphotos-ak-xfp1/v/t1.0-9/s130x130/10273552_10153112912635815_1614333222331032085_n.jpg?oh=3bae74cf166729f5bfcdba5d5ccc0a11&oe=5559941D&__gda__=1429080548_4649389886b2005bafba674aa433096b"},{"message":"Had lunch at Grab Eat today in Koramangala. Super average food n ambience. Wonder why is to hyped. Biryani was below average and the mango shake tasted more like Mango lassi. \n\nRating 2.5/5","id":"527236893956335_1000794366600583"},{"message":"Thalassery restaurant  Marathahally...Chicken dum biriyani(thalassery style)..awsome","id":"527236893956335_1000958403250846"},{"message":"Home made veg Biryani and peas, paneer and potato curry..jus loving it.","id":"527236893956335_1001367463209940"},{"message":"Hot and Spicy Beef Sheek and Beef Biryani :D","id":"527236893956335_1001564373190249","picture":"https://scontent-b.xx.fbcdn.net/hphotos-xpa1/v/t1.0-9/s130x130/10940449_10204227908112295_2381907501848196436_n.jpg?oh=da48ecab4c7345a019cc7667c309f95a&oe=5524E55B"},{"message":"Hi All,\n\nWhere can I get best Veg Biryani in Bangalore? I have been a fan of Meghana Biryani (Veg) for years. However, now I need some change in taste...please let me know if you all are aware of any restaurant which serves good veg biryani.\n\nThanks,\nRam","id":"527236893956335_1001906799822673"},{"message":"The best thing about Huliyappa Donne Biryani is the consistency in taste and the fact that you can have it everyday.","id":"527236893956335_1001919126488107","picture":"https://fbcdn-sphotos-c-a.akamaihd.net/hphotos-ak-xpa1/v/t1.0-9/s130x130/10942627_10153086132483760_6634644632009256660_n.jpg?oh=9402f903fc718ed88be4b1fb5f5fea5a&oe=5520F625&__gda__=1428691418_1f6f6b80e1d7b9951867af98b5f920df"},{"message":"Veg Biryani @ 24@43 in Crown Plaza, Electronics City.\nPrepared on my request :)","id":"527236893956335_1002451239768229","picture":"https://scontent-a.xx.fbcdn.net/hphotos-xpa1/v/t1.0-9/s130x130/10922746_1049090465107477_5784336817629808974_n.jpg?oh=0273d019562a692bcbee43b8750243d1&oe=5527E912"},{"message":"Hyderabadi Chicken Dum Biriyani. \nIndia's answer to Italy's pasta, the French Beef Bourguinon and the Spanish Paella.\nResults?? \nAfter the first few frantic gluttonous greedy forkfuls,you will slow down...and start to savor the various intricate complex flavors of the dish..wonder at how a few ingredients can be turned into something thats an art in itself.. how the marriage of basmati rice and chicken can seem like its made in heaven... \nAnd then you will forget everything else..and simply sink in. \n\nINGREDIENTS:\nFor the Biriyani Garam Masala: \nshahi jeera: 1/4 tsp\ncinnamon: 2 small sticks\n4 green cardamom\ncloves: 2\n10 black peppercorn\nA piece of mace and nutmeg\n\nFor marination of meat:\nChicken : 500 gm cut into big chunks.\n100 gm thick curd/yogurt\n4 chopped green chilies\n2 tbsp ginger garlic paste\n1 tbsp red chilli powder (adjust per your taste)\n1/4 tsp turmeric powder\n1/2 tbsp coriander powder\n1/2 tbsp cumin powder\n1 tsp all garam masala (The recipe is above )\nFried onion of 3 medium onions\n1/2 cup chopped coriander leaves\n3/4 cup pudina leaves\njuice of 1 lemon\n1 tsps salt\n2 tbsp Ghee/ clarified butter\nBiriyani Masala (I used Hakim brand) 3 tbsp\n\nRice preparation:\n2 Cups good quality Basmati Rice\n4 cloves\n4 cardamoms\n1 black cardamom\n1″ cinnamon stick\n1 bay leaf\n4 black pepper corns\nNutmeg and mace\n2 tbsp salt\n1 tbsp oil\n1 tsp shahi jeera or caraway seeds\nwater as required\n\nSome other ingredients:\nBrown onion in a large amount ( I needed 4 medium onions)\nsaffron milk (a large pinchful(\nGhee/ clarified butter (as required)\nRose water ( 1 tbsp)\nChopped Coriander and mint leaves ( handful for layering)\n\nMETHOD:\nStart by making the garam masala. \nLightly roast all the ingredients on a girdle till fragrant. Do this on low heat so that it doesnt burn.If burnt it will make the whole masala bitter!! \nOnce roasted, cool and grind to a powder. Coarse or fine is upto you. \n\nNext, start with the marination. \nI typically do the marination the previous night so that I can prepare this for lunch. Mostly made on Sundays as it takes time and not possible on working days.\nStart by frying the onions till golden brown.\nNext,in a large bowl, add all the marinating ingredients to the chicken. Put yoghurt, ginger garlic paste, Red chilli powder, Turmeric powder, Garam Masala powder, Lemon, Fried Onions, Green Chillies, Coriander (finely Chopped), Mint ( finely chopped),Salt to taste, oil/ ghee, biriyani masala and mix well.\nNow cover and keep it in the refrigerator for atleast 2-3 hours and overnight  for best results.\n\nNext day: (or whenver you are making the biriyani)\nTake the chicken out of the refrigerator and let it come to room temperature.\nIn the meanwhile, measure,clean and soak the rice for 30 mins.\nWhile rice is soaking and the meat is normalising, finish frying up the 4 onions, chopping the herbs and making the saffron milk. \nTo make Saffron Milk. Slightly roast and crush the saffron strands and put them in lukewarm milk. It gives the biryani distinct flavor and orangey- yellow streaks. Keep it aside.\n\nNext, for the Rice Preparation:\nIn a large pan, bring surplus water to boil. Take a piece of soft clean cotton cloth, add all the whole spices mentioned and make a bundle of it.\nNow drop this in the water, add a dollop of ghee, salt and let it come to a full boil.\nAdd the rice and let it cook just till half done. It should be grainy. And please do not over cook the rice.Now drain out the water and save the drained water because we will be using this water also..\n\nCooking the chicken: \nTake a deep heavy bottomed dutch oven or kadhai.\nAdd some ghee to it ,once hot, add the marinated chicken. Let it cook on high for 5 minutes undisturbed.\nMix once and let it cook on low for 15 minutes. Add the reserved water (about a cupful) to the chicken. \nWhen the chicken is half cooked we will start the process of layering. \n\nLayering:\nIn the base of the dutch oven (cauldron) that you cooking in, make sure the chicken is comfortably laid out in one layer.Make sure the chicken has some water (or ras as we call it).because the meat needs some moisture to cook which it gets from this \"ras\" and thus overall biriyani remains nice and moist.\nPut the half of the rice on the top of the chicken. Spread the rice well so that it covers all of the chicken.Add the fried onion, some of the chopped herbs, half of the saffron milk, ghee and garam masala powder on the rice.\nNow layer rest of the rice on it and spread rest of the fried onion, chopped herbs, saffron milk .Sprinkle the rose water and add the ghee in a drizzle alone the corners and some in the centre of the rice.\nAfter layering the rice and meat, make sure atleast  1/4th of the vessel is free for the steam to collect and aid in cooking.\nNow you can either seal the edges with roti(whole wheat) dough or use a piece of foil paper and seal the top. I use the easy and faster foil paper.\nNow cook it for 5 mins on high flame.\nWhile this is cooking, take a iron girdle or tawa and heat that up.\nNow place the dutch oven on the hot tawa,turn the heat down to the lowest point and let it cook on simmer for almost 45 minutes.\nOnce time is up, switch off the gas, take it off the hot tawa and let it remain closed and sealed for atleast 15 min or till ready to serve. \nFluff up the rice when ready to serve..and serve by sinking in a spoon to get all the layers.\nServe with a simple cucumber raita,some salad and masala mint lemonade!!\nSimple,delicious..and perfection!\n\nChef's Notes: \nWhen you are choosing meat for biryani, make sure meat pieces are big in size and they are raw tender otherwise the biryani will not come out well.\nI use rice and meat in 1 :2 ratio. However If you want you can make 1:1 or 1:1.5 ratio. \nNow what is the right kind of cookware to make biryani? Traditionally the biryani is cooked in degchi. As it is not available everywhere except India, you can use a vessel whose bottom is round, thick and deep to make sure that the meat does not stick to the base of the vessel. I use a basic deep cauldron with a tight lid (which is really essential)\nI tie up the whole spices in a muslin cloth coz then it can flavor the rice without me having to bother picking them out later. You can omit this if you so wish or don't mind biting into whole spices. \nSoaking the rice is also very important because it helps the rice expand to maximum length. So soak it in the water for 30 minutes. Choose long grain basmati rice.\nI got Hakim Biriyani Masala from a gourmet store here. If you can't find it, you can use Everest Shahi Biriyani Masala.Or make your own if you are so inclined. I generally don't coz of the shortage of time.\n\nLove,\nS :)","id":"527236893956335_1002487809764572","picture":"https://scontent-a.xx.fbcdn.net/hphotos-xpf1/v/t1.0-9/s130x130/1962606_1063460080335008_2375854436227046410_n.jpg?oh=3751ac059c5ebbe5d4124edba74a83f9&oe=55670888"},{"message":"Shocked to See the Quantity of Veg Biryani @ Pot Biryani in Electronics City.\nTaste was superb :)","id":"527236893956335_1002670313079655","picture":"https://scontent-b.xx.fbcdn.net/hphotos-xpf1/v/t1.0-9/s130x130/10407057_1049305938419263_9202194232405205344_n.jpg?oh=73a2fa7bb1df6178ff958fcde8346c0c&oe=552BD8D9"},{"message":"Superb khao gali dinner buffet at Cafe Mozaic yesterday with all kinds of \"street food\"- pav bhaji, kheema pav, chaats galore( samosa chaat, tikki chaat, papdi chaat, sev puri, bhel puri and so much more) , chai, saffron milk, lassi, parathas, tikkis. Plus there was a regular buffet fare too ( lamb biryani, fish curry and a bunch of other yumm stuff). They also had grilled prawns, grilled veggies. There was a nice dessert spread as well .All this with beer or mocktails.... Good stuff! No pictures unfortunately :(","id":"527236893956335_1002868946393125"},{"message":"Trying Mast kalandar for the first time,got Home biryani combo.","id":"527236893956335_1002953229718030"},{"message":"Trying the new teatime menu at Ammis Biryani. Pao & kheema, and rolls.","id":"527236893956335_1003024259710927"},{"message":"Ordered veg biryani n eggs. Hot n yummy..","id":"527236893956335_1003124119700941","picture":"https://scontent-a.xx.fbcdn.net/hphotos-xpa1/v/t1.0-9/s130x130/10940448_10203665488103495_3473437752658936110_n.jpg?oh=ef237f775403bc260d9352745970f9c5&oe=555AD42C"},{"message":"Hey guys. Am planning to try out Paradise Biryani at Indiranagar this weekend. How many of you have tried the same? Any reviews and recommendations ?","id":"527236893956335_1003175946362425"},{"message":"There are biriyanis and there are biriyanis from places you grew up in. The best ever in Calcutta, bad ambiance, brilliant food. Chicken Biriyani, chicken curry and firni!","id":"527236893956335_1003460906333929","picture":"https://fbcdn-sphotos-f-a.akamaihd.net/hphotos-ak-xpa1/v/t1.0-9/s130x130/10947248_10152999400925540_1584306823408920899_n.jpg?oh=4a0e34da15ee5422a4004636d758fccd&oe=55680DD5&__gda__=1433153578_0d6107f6987e19d88a427e5fbc24a404"},{"message":"Biryani at Nagarjuna Bannerghatta Road.","id":"527236893956335_1003491972997489","picture":"https://fbcdn-sphotos-d-a.akamaihd.net/hphotos-ak-xfp1/v/t1.0-9/s130x130/10933928_819719941408269_353576504295633778_n.jpg?oh=9f82e85d725bb9e9f6fd5ac11dfc1829&oe=5525EFED&__gda__=1432814495_8e6fce6c0352d9db99dd1feec1a77e0a"},{"message":"Chicken Handi Biriyani..\n\n1st Food Post of 2015... \nAnd what do I have in store for you... ??\nWell, something thats really close to my heart..a dish that set me off on the path of this gastronomic journey...a dish that P loves and is almost a weekly indulgence at my home...A dish I hope baby D learns to relish too. \nBiriyani to me is a religion.Yes, There is no other word for it. \nI am extremely high maintenance when it comes to biriyani...You can't just call any one pot rice as Biriyani..It has to be perfect. \nAnd I know I dish up a mean Chicken Biriyani... \nPresenting to you, the Art that is Biriyani...\n\nWishing a yumm and sumptuous year for all my food loving friends at BFC!\nLove,\nS :)","id":"527236893956335_988342637845756","picture":"https://fbcdn-sphotos-h-a.akamaihd.net/hphotos-ak-prn2/v/t1.0-9/s130x130/10906050_1046369452044071_6389575914308341357_n.jpg?oh=ae30584b553b108ea7058cd4d8dd9d05&oe=552C093E&__gda__=1432298762_1376c405c14d4329a5f8ca0c9e12952f"},{"message":"Take away : Hot Hot beef Biriyani 4 lunch from Hotel Taiba #hubli . 😋😋😋😋😋😋","id":"527236893956335_988760087804011","picture":"https://fbcdn-sphotos-c-a.akamaihd.net/hphotos-ak-xpf1/v/t1.0-9/s130x130/10464190_10154997858030500_113080500344651197_n.jpg?oh=7220dff9566f1dfc25c617526628fefa&oe=556B9B7B&__gda__=1432899536_34d6f08bc5b40d8bde9917cd8c5b6d1c"},{"message":"Chicken biryani at navauga","id":"527236893956335_988797484466938","picture":"https://scontent-a.xx.fbcdn.net/hphotos-xpf1/v/t1.0-9/s130x130/10353020_777929338943421_6901008792917006108_n.jpg?oh=30b43f1e2bc2a8810e838971cc6e4f0c&oe=555AEE8A"},{"message":"Birthday Dinner Dastarkhwan- Hara Bhara Murgh, Rotis, UP style mutton dum biryani with lehsun ki chutney, Tandoori Murgh, Mung daal ka halwa","id":"527236893956335_988956794451007","picture":"https://fbcdn-sphotos-h-a.akamaihd.net/hphotos-ak-xap1/v/t1.0-9/s130x130/10885060_10153055339359274_5845227204393013869_n.jpg?oh=9df28721d43d411f13a740c246be27cd&oe=5521A959&__gda__=1432242146_de813cacde594bf189948f99e6de1b32"},{"message":"Hi folks, apart from Meghana Biryani in Blore what are the other places which are famous for serving Biryani?","id":"527236893956335_989527997727220"},{"message":"Had been to Imli Cafe & Restaurant  for lunch today. :)\nItems ordered - \nStarters - Cheez aur Aaloo ke goley , Cheez aur Makai ke Goley\nMain course - Butter Kulchas and Rotis, Bacchu Makai Do Pyaza gravy\n,Sofyani Biriyani\nTwo teas.\nNet bill ~~ 1400/- \n\nThe appetizers were quite filling on their own, being as \"cheezy\" as they were. But we managed to wolf down the main course as well :)\n\nFood quality = Very Good :)\nAmbience = Pleasant. (The cool weather may have helped)\nHospitality = Very Good. \n\nP.S - Owing to concentration on food during said \"wolfing\" , I was unable to take any pics :-/ Will add them next time, coz there Will be a next time to Imli :) \n\nP.P.S Only veg though. Non-Veg aficionados won't be as pleased with the place as I'm coming off I guess :D\n\n#MyExperience","id":"527236893956335_989619177718102"},{"message":"Nawabi Avadhi Biryani....Twist Bangalore","id":"527236893956335_989694344377252","picture":"https://fbcdn-sphotos-h-a.akamaihd.net/hphotos-ak-xpa1/v/t1.0-9/s130x130/10421607_807442469291451_258490838462302209_n.jpg?oh=f76fc77252ea4d7c3879ff414e54b57e&oe=5524C14A&__gda__=1428904861_6c0e3287bcf3784337f98479e1b53fe5"},{"message":"Biryani cravings... \n\nParadise Biryani of HYD opened up in Indiranagar? Where exactly is the location?","id":"527236893956335_990219394324747"},{"message":"Paradise opening only on the 8th of January. Just got the news from a very angsty wife after going all the way there to pick up biryani for her husband... Me!","id":"527236893956335_990402430973110"},{"message":"First time made Dum Biryani with Brown Rice( tried following my mom's recipe, but did not have all the ingredients)...so its my Ishtyle Biryani...turned out to be very tasty than the Basmati version....Guests compliments...and accompaniments turned out to be as colourful as the Biryani.....:-)","id":"527236893956335_990440717635948","picture":"https://scontent-b.xx.fbcdn.net/hphotos-xap1/v/t1.0-9/s130x130/10891453_10153025518965917_6771704742055477048_n.jpg?oh=e90fb6f99203a997c401d24360bb2aaa&oe=556507D9"},{"message":"Paradise Biriyani Hyderabad comes to bangalore...\n\nhttps://www.foodpanda.in/restaurant/v1sw/paradise-indranagar?utm_medium=email&utm_source=Newsletter&utm_campaign=20150105_Bang","id":"527236893956335_990977570915596"},{"message":"FYI ! ATTN ! To All PARADISE BIRIYANI LOVERS who were curious to know when they would open ! Just got this message from Food Panda. The Paradise Biriyani on CMH road to open on 10th Jan. Until then Peace 😊","id":"527236893956335_990985720914781","picture":"https://fbcdn-sphotos-c-a.akamaihd.net/hphotos-ak-xap1/v/t1.0-9/s130x130/10896852_10155017402625500_2734982313807077816_n.jpg?oh=afb95c2345ba252f6bc366de6751dc34&oe=552566B3&__gda__=1431833608_096d825f083cf21c78618b1fd8f32754"},{"message":"Country Chicken/Naati Koli Biryani @Meghnas, Indiranagar...\n\nWas Good but it is not a true Biryani in the real sense of word...it's basically Chicken Dum Biryani Rice topped with Naati Koli Roast/Masala...","id":"527236893956335_991868677493152","picture":"https://scontent-b.xx.fbcdn.net/hphotos-xpa1/v/t1.0-9/s130x130/10686821_10205617678780987_8447244674559998155_n.jpg?oh=405c2dd6cd9ece23e58c1ab2a45172da&oe=55281526"},{"message":"friends\ncan anybody tell me where in Bangalore, we will get original lucknow Biriyani.... There are few food joints who claims to serve original Awadhi recipe , but did not find an authentic one...","id":"527236893956335_992127367467283"},{"message":"Hey ,I saw some where that Hyderabad paradise biryani opened in indiranagar,is this true please let me know here exactly it is?","id":"527236893956335_993271774019509"},{"message":"A small self service restrau near Central bus stop,Close to Near Mantri mall.. Serves awesome North Indian food.. Their Palak Biryani is a MUST Have! \n\nVishnu Sagar is the name of the reatrau!","id":"527236893956335_993765650636788","picture":"https://fbcdn-sphotos-e-a.akamaihd.net/hphotos-ak-xpf1/v/t1.0-9/s130x130/10407735_10205442949856223_1011769733156596164_n.jpg?oh=27a7dac3f0dad46459ffb6d526d61633&oe=556579AD&__gda__=1429151163_50ede5a92fb675fcb751dcdb712a04b9"},{"message":"Where s Hyderabad Paradise Biriyani ? Landmark Plz .thanks","id":"527236893956335_994093570603996"},{"message":"After about 20 posts on the topic and a month long wait , #Paradise finally opened today when the owners from Hyderabad cut the ribbon and started rolling out the Biryaanis. The interiors are amazing and carry a story of how biryani is made. The Biryani was pretty close to the one in Hyd and should match it up once full operations start !\nThe owners seem very keen on maintaining the quality and are opening 2 more in Frazer Town and Koramangla. \nPS - had to have a pic with Mr. Kazim (co owner) of Paradise.","id":"527236893956335_994532480560105","picture":"https://fbcdn-sphotos-b-a.akamaihd.net/hphotos-ak-xap1/v/t1.0-9/p130x130/10391024_10152634248413379_7424569134879707983_n.jpg?oh=1bf65ce026fdb49572fc7f031f3452cc&oe=55638C1D&__gda__=1432617382_c8efad959f6fd9673ff7402cd38a34b1"},{"message":"Guys suggestion please.. where do i find the best basmathi rice for biryani. Branded/unbranded... i need restaurant style longggg grain... please help...","id":"527236893956335_994889057191114"},{"message":"Foodies can some please suggest a good biriyani place near cv Raman nagar or indiranagar....","id":"527236893956335_994915730521780"},{"message":"I think Bengaluru is the Biryani Capital of our country. I don't think any other city can match the varieties of biryani as offered in our city. Your opinions on this my foodie friends? And also a hearty welcome to Paradise as the latest addition...","id":"527236893956335_994954037184616"},{"message":"They paved indiranagar and put up a Biryani lot. Paradise dinner happening","id":"527236893956335_994966690516684"},{"message":"Biryani at Paradise takes you to paradise. Nothing more to add and of course no patience to post pics...","id":"527236893956335_994970283849658"},{"message":"Sorry guys for beating this topic to death. I did search online and this group but did not find good posts. \n\nCan somebody tell me where can I find good Ambur biryani in Koramangala?","id":"527236893956335_995242923822394"},{"message":"Paradise Biryani Food Court- First day last show finally happened. \nReached there around 9.30 PM and the place was packed in a very  haphazard way, a couple was sitting in a table meant for a larger group, there was singles being seated for a double table etc..  finally we got a table. Had to wait for sometime for the staff to notice us, even though we were quite close to the order booking  area. Finally we managed to place our order- Chicken Biryani, Mutton Biryani, Mutton Seek Kebab , Vanilla Milk Shake and a Qurbani ka Meeta . Then we waited..and waited ( one of the worst things that can happen in a restaurant, is being made to wait for food for more than 15 minutes, unless there is some crisis and your informed about it) . Finally after some umpteen “excuse me’s” from my wife, I had to reach out and catch hold of a passing floor manager to get his attention. He looked blank, checked the computer and rushed. Then the waiter arrives with Strawberry milkshake, which we politely returned , after sometime the vanilla arrives and my very hungry daughter is happy. After apologizing on some order goof  ups our biryani’s arrive and then the kebabs. \n\nThe biryani’s were excellent- not oily, perfectly spiced, nicely flavored with superbly cooked pieces of mutton and chicken. The seek was also well done and juicy.  Enjoyed the meal thoroughly and asked for the desert after a few moments the waiter comes and asks  would you like it with vanilla ice cream. I said no, I do not like to eat ice cream with Qurbani, it is unheard of so just get it as is. He goes and after sometime returns and says there is no Qurbani ka meeta, I will give you gajjar ka halwa. \n I decline and tell him to get us  the finger bowls and bill. The finger bowls arrive with cold water in it, again I ask” why would you give cold water” the waiter says “ no hot water available”. We pay and leave. \n\nI do understand that it was the opening day and there will always be a few screw ups, but  this restaurant has been in the business for a long time and by now it should have been running like a well oiled machine. Most of the staff I noticed were walking around aimlessly as if they are not sure what they should be doing there. Maybe a debriefing on their roles will help get the tempo going. \nWill I go there, of course,  but maybe only  to pack food or call for home delivery when that service begins.","id":"527236893956335_995275347152485"},{"message":"Hey All - I was planning to order a parcel from Paradise Biriyani. Do you have the phone number where I can reach them?","id":"527236893956335_995278037152216"},{"message":"Been to Paradise Biriyani today. Enjoyed our biriyani, also met Dr. Kazim, Director of Paradise Biriyani.","id":"527236893956335_995395247140495"},{"message":"Biryani is the theme here on BFC.. There's biryani talk everywhere.. Here's something from me..","id":"527236893956335_995421507137869","picture":"https://fbcdn-sphotos-f-a.akamaihd.net/hphotos-ak-xap1/v/t1.0-9/p100x100/10348602_10152579114951860_44230057109212092_n.jpg?oh=27debf89729510fc7294e7e20c844d12&oe=5557BABD&__gda__=1432498147_c159071cd08f87fdb43dc35f540c29c3"},{"message":"Verdict - Biryani journey continues. Nalli journey ends. Phirni is a must have - cherry on cake.","id":"527236893956335_995470363799650","picture":"https://scontent-b.xx.fbcdn.net/hphotos-xfp1/v/t1.0-9/s130x130/1508028_10152520969202703_4707250841550116775_n.jpg?oh=d34d3a8ef52b7635643924d416441500&oe=556DB7A9"},{"message":"Don't you guys love Biryani?? It is my favorite meal and home made Biryani is the best. \nhttp://www.peppergarlickitchen.com/quick-easy-chicken-tikka-biryani/","id":"527236893956335_995500903796596","picture":"https://fbcdn-sphotos-h-a.akamaihd.net/hphotos-ak-xap1/v/t1.0-9/s130x130/10933732_10152997752261944_8258104572351737_n.jpg?oh=5efdd5d5ba9aae62c541e68ced262211&oe=555B76BE&__gda__=1428547735_f5d072965af82475ca884570cdd6178b"},{"message":"Day 2 at Paradise. Got to taste the double ka meetha :) . Biriyani's awesome taste is compensated by the pathetic service.","id":"527236893956335_995530280460325","picture":"https://fbcdn-sphotos-c-a.akamaihd.net/hphotos-ak-xap1/v/t1.0-9/q83/p130x130/10898302_10155096584530013_3000008787100769992_n.jpg?oh=157fa41b90eb5b99f633d6a75e85ef94&oe=555EADCD&__gda__=1432214790_d0711f455d7aad1da416089122343194"},{"message":"Paradise @ Hyderabad, jumbo Biriyani for 4. Are they serving this in Bangalore too?","id":"527236893956335_995626673784019","picture":"https://scontent-b.xx.fbcdn.net/hphotos-xpa1/v/t1.0-9/s130x130/10933855_10152978656677552_7782603702572450296_n.jpg?oh=ebe4a7dc3bbc99d2b061f9ba6eefdefa&oe=552D53CC"},{"message":"All this talk of Biriyani had me craving some -\nSeemed more authentic with the boiled egg! ;D","id":"527236893956335_995988580414495"},{"message":"Macaroni biryani flavoured topped with egg and meat balls for breakfast...!  :D   Ingel is gonna freak out!  :D","id":"527236893956335_996022007077819","picture":"https://fbcdn-sphotos-g-a.akamaihd.net/hphotos-ak-xap1/v/t1.0-9/s130x130/10898242_10204600898235038_7787090814001885786_n.jpg?oh=1a8f5f8426f8cd05d6eb54fddb5a4e1b&oe=552421B1&__gda__=1432101386_b47cbccabae396edc9f79543551a927d"},{"message":"Chicken biryani - tasted more spicy than expected. The soup and the raitha were just about fine. A decent joint. Near Domlur Flyover","id":"527236893956335_996093427070677","picture":"https://scontent-b.xx.fbcdn.net/hphotos-xap1/v/t1.0-9/s130x130/10917073_10203411935916106_3907115571772241848_n.jpg?oh=b4801ee74e0af7c92ce714d27135aa2e&oe=552BA53E"},{"message":"Ordered veg biriyani as takeaway from Paradise biriyani indiranagar.\nPositives: No rush for takeaway..out in  5 min. The basmati rice is of good quality (-Daawat brand as advertised). The mirchi ka salan is good.\nNegatives: The biriyani doesnt have enough masala to mix up..had lumps of white rice even after mixing well. Taste is ok ok. Veggies were less and the raitha was watery.\nPrice: 190 + tax comes to around 220 for a veg biriyani...enough for 2 ppl to eat.","id":"527236893956335_996094630403890"},{"message":"Famous biryani tea aka Dancing tea@ paragon","id":"527236893956335_996111320402221","picture":"https://fbcdn-vthumb-a.akamaihd.net/hvthumb-ak-xfp1/v/t15.0-10/10875990_10155035389825573_10155035185650573_44466_1043_t.jpg?oh=8da99584b33f75889bcc15ddcc2bb960&oe=556C1978&__gda__=1428682768_4133082e9f509af6b21fe8c19d67d830"},{"message":"Paradise at CMH road. The biriyani dint impress me.","id":"527236893956335_996320940381259","picture":"https://fbcdn-sphotos-c-a.akamaihd.net/hphotos-ak-xfa1/v/t1.0-9/s130x130/1458425_10153552941390288_8236327712517762563_n.jpg?oh=5c0b4451f00c12a8f2355dd0e4484340&oe=552A0BF7&__gda__=1433281660_d8390c3bd5477d6c252c91e2d5ca48b0"},{"message":"Good morning! Need recommendations for home delivery of a GOOD mutton Biryani. Prefer the long grained rice, delicately spiced variety (Kolkata/ Dum Biryani). I live near Indiranagar and need it for lunch.","id":"527236893956335_996551297024890"},{"message":"Donne biryani @ shivaji hotel bsk","id":"527236893956335_996566297023390","picture":"https://fbcdn-sphotos-g-a.akamaihd.net/hphotos-ak-xaf1/v/t1.0-9/s130x130/10917843_1600650150155822_4762569523465502242_n.jpg?oh=52ce83b52780a56e7c00191a7e1beb5c&oe=556F6C92&__gda__=1429109662_208b7f2d9e730c6e9a7cd1e5fc7b42a2"},{"message":"I liked the Paradise Biriyani :-)...Was skeptical when I walked in based on the mixed reviews...but to my relief it turned out to be pretty good. Had Mutton Biriyani and it was *Perfect*...Mutton very tender and easily coming off the bones...No overdose of Masala...Not too Spicy...Easy on the tummy...We also tried the Egg Biriyani n packed a Veg Biriyani...I hope they can keep the consistency...","id":"527236893956335_996615733685113","picture":"https://fbcdn-sphotos-b-a.akamaihd.net/hphotos-ak-xap1/v/t1.0-9/s130x130/10906559_10205669327712178_4282662261021402291_n.jpg?oh=9f7300132ab0878515dd60b80e1c302d&oe=555D56B0&__gda__=1432730379_460635af2e5a356cb72ce0387e3ac4f8"},{"message":"Wine tasting!!!\nA great experience at Grover Vineyards, not to be missed! \nThe tour includes wine tasting (tastes heavenly with cheese) and a forgettable biryani lunch. Go there for the wine, not for the lunch.","id":"527236893956335_996700700343283","picture":"https://fbcdn-sphotos-f-a.akamaihd.net/hphotos-ak-xap1/v/t1.0-9/s130x130/10931337_10205481388491828_6272150695512145857_n.jpg?oh=498009b174ad2df4739cd541b4e9de5b&oe=5560E65D&__gda__=1433060838_5ce039c4134ee65d0a981a9a872f2592"},{"message":"This was at Cafe Bahar , Hyderabad!\nI felt Biryani here tasted much better than Paradise :D  \nWell , wasn't surprised when I later found out that , this was rated the Best Biryani by Times food guide 2014 - Hyderabad:)","id":"527236893956335_996767670336586","picture":"https://fbcdn-sphotos-f-a.akamaihd.net/hphotos-ak-xpf1/v/t1.0-9/s130x130/10471355_932455603432116_3197502792276424259_n.jpg?oh=410799be0ec3ca62a26f7eb698c70e8d&oe=5529DD2C&__gda__=1433191313_e0c34877a46b86ca92e167aacbd571c5"},{"message":"Where exactly is the Paradis Biryani Outlet located in the city?","id":"527236893956335_997094223637264"},{"message":"Time again for some chicken biriyani and pepper barbeque from zaitoon","id":"527236893956335_997325873614099","picture":"https://fbcdn-sphotos-g-a.akamaihd.net/hphotos-ak-xpa1/v/t1.0-9/s130x130/10915136_10152476709886862_3556957502433227798_n.jpg?oh=69ce5cca0ff68fdac1ba23e9acd239da&oe=552655CE&__gda__=1432775729_c6c9a704a91b8b7ee9f29f281dc852e9"},{"message":"All I can say a well Cherished Dinner at  Absolute Barbecue yesterday. The Dinner was Sumptuous with wide range of Spread.\nOn starters we had BBQ Texas Prawns, Fish, Chicken wings, Chicken BBQ ,Mutton Roll, Stuffed Mushroom and Cinnamon pineapple.\n My Fav on Wishlist Grill  was Seafood melody . Other options were Rabbit with Bone, Quail and Emu. \nMain course I had Chicken Dum Biryani with Srilankan Shrimp curry & Bengali fish Curry. \nThough Mutton ,Chicken and few veg spread was available didn't try.\nOn Desserts personally liked Saffron Phirni, Rasamalai & Pineapple cheese cake.\n\nOverall a Very Happy Dinning Experience.","id":"527236893956335_997895773557109","picture":"https://fbcdn-sphotos-f-a.akamaihd.net/hphotos-ak-xfp1/v/t1.0-9/s130x130/1660685_10202168689858430_9008713632250831072_n.jpg?oh=e63bf32e1d75c4f9a5c0c0dc9ae1eb84&oe=55221C3B&__gda__=1432875754_179982aca74bda62f6f124fe6edb29cc"},{"message":"The biriyani from suchitra and pepper chicken.. super duper spicy....","id":"527236893956335_998004873546199","picture":"https://scontent-b.xx.fbcdn.net/hphotos-xpa1/v/t1.0-9/s130x130/10933963_10152478251466862_6186930670590215785_n.jpg?oh=14ba10c3dd642115a990c93cda3db4f7&oe=556CA0B5"},{"message":"We see minimum 2 'Where's Paradise Biryani', 'Buffet options', 'Team outing', etc.. in a day and that's mostly because maybe people dont know about the \"Search\" function..so here it is!","id":"527236893956335_998315846848435","picture":"https://fbcdn-sphotos-e-a.akamaihd.net/hphotos-ak-xaf1/v/t1.0-9/s130x130/1484268_10152644919048379_8445357900746274300_n.jpg?oh=f89856db4f8b8eaa458f843551b2a7d3&oe=552D2833&__gda__=1432485951_0f2b718d31e9a598f0f72a1602ad1e49"},{"message":"Paradise Biryani\n\nI find it the Yuckiest thing ever!","id":"527236893956335_998387403507946"},{"message":"On my last visit to Bangalore I explored this Eggtastic place… \nEGGFACTORY: Located on Ground Floor, Whitehouse, St. Marks Road, Bangalore\n\nEGGCELLENT place as food served here is EGGTASTIC :) \nCozy place in a bylane off the bustling St Mark's Road. The ambience is laidback and earthy with wooden benches and few metal tables. Easy to hold flipflap flyer is the Menu with some EGGTASTIC offerings. \n\nOne can have eggs scrambled, tossed up as an omlette, cubed into frittatas, laced on pasta, stuffed in a sub, rolled in a wrap, cooked in curry or layered in a biryani… yummm is the word for this place… the choices are prolific and immensely palatable. In an eggshell it is EGG FACTORY…\n\nThis place has grabbed steady attention of office-goers on St Marks Road. But like me who saunter in from other area because of word-of-mouth reviews. When I stepped in I was wondering in how many character-of-dishes one can imagine with an EGG? But then flip-flap-menu leaves u with temptation to try all of them. The popular ones here are Crostini and French Toast where as the traditional side of the menu curries with parantha or rice combo have been talked about amongst the friends who referred us. Adventurous menu as there are varieties from around the world – notably SriLanka, Indonesia and Malaysia but yes apart from the ubiquitous Italian and Mexican which is found everywhere. \n\nThe Egg Factory deserved 10/10 for making the egg taste so different in each dish. The flavours are subtle, not too spicy, nor greasy and easy on stomach. Not to miss we were 3 people and the bill was only and only Rs. 627. The prices are pretty decent. There is room for improvement there. The coffee is excellent. The service is great albeit a tad slow perhaps.There were probably too many waiters floating around in a higgledy-piggledy manner.\n\nSupremely satisfying food… without a doubt you will have more hits than few misses.\n\n Visited in October 2014.","id":"527236893956335_999127193433967","picture":"https://fbcdn-sphotos-c-a.akamaihd.net/hphotos-ak-xpa1/v/t1.0-9/p130x130/10801761_10152543208267102_1655285317686158413_n.jpg?oh=f11a36ff08019434b40b536d428f4b4c&oe=5527873B&__gda__=1428555716_bc99ffaa7525e6c00ebbd17a0534d59e"},{"message":"We do kaathi rolls and biryani stalls in office food courts, parties, events etc. Kindly get in touch if there is any requirement. Have a state of art kitchen that meets all statutory compliances. Please feel free to request tasting. :)","id":"527236893956335_999141990099154"},{"message":"Holiday Dinner at home - Mutton Chops & Mutton Biriyani","id":"527236893956335_999246103422076"}]